Revit 2027 API
Zone.Area Property
Get the Area of the Zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Area { get; }
Public ReadOnly Property Area As Double
	Get
public:
property double Area {
	double get ();
}
member Area : float with get
Property Value
Double
Remarks
This property is used to get the Area of the Zone.
See Also
Reference
Zone Class
Autodesk.Revit.DB.Mechanical Namespace